# Project - Pandas and Excel Export
### Goal
- Learn how to use Pandas DataFrames
- Export to Excel spreadsheets

### Description
- import pandas as pd
- Read the CSV file files/SalesData.csv with pandas
    - Remember to set index_col to Date, delimiter to ';' and parse_dates to True
- Group the data by **Sales rep** and sum it
- Group the data by month
    - HINT: Use pd.Grouper(freq='M')
    - HINT: Change the index naming to use month names
- Export the data to Excel
    - Create an ExcelWriter from Pandas
    - Write a sheet with **Sales rep** data create above (remember to set sheet_name)
    - Write a sheet with **Monthly** data created above (remember to set sheet_name)
- Bonus:
    - Create charts column charts for each sheet.
    - Use the simple way we created it.

In [10]:
import pandas as pd

In [11]:
data = pd.read_csv("files/SalesData.csv",delimiter=';',parse_dates=True,index_col='Date')

In [12]:
data.dtypes

Sales rep    object
Item         object
Price         int64
Quantity      int64
Sale          int64
dtype: object

In [13]:
data

            Sales rep        Item  Price  Quantity  Sale
Date
2020-05-31        Mia     Markers      4         1     4
2020-02-01        Mia  Desk chair    199         2   398
2020-09-21     Oliver       Table   1099         2  2198
2020-07-15  Charlotte    Desk pad      9         2    18
2020-05-27       Emma        Book     12         1    12
...               ...         ...    ...       ...   ...
2020-02-28     Oliver  Desk chair    199         5   995
2020-10-01     Sophia       Table   1099         4  4396
2020-07-28     Sophia        Book     12         1    12
2020-06-21       Liam         Pen      3         4    12
2020-01-26       Noah  Desk chair    199         5   995

[1000 rows x 5 columns]

In [14]:
data.head()

            Sales rep        Item  Price  Quantity  Sale
Date
2020-05-31        Mia     Markers      4         1     4
2020-02-01        Mia  Desk chair    199         2   398
2020-09-21     Oliver       Table   1099         2  2198
2020-07-15  Charlotte    Desk pad      9         2    18
2020-05-27       Emma        Book     12         1    12

In [15]:
data.groupby('Sales rep').sum()

           Price  Quantity    Sale
Sales rep
Charlotte  25082       315   74599
Emma       25241       342   65867
Ethan      14114       291   40970
Liam       23534       328   66989
Mia        28641       346   88199
Noah       28310       333   78575
Oliver     32089       342   89355
Sophia     30735       335  103480
William    27204       326   80400

In [17]:
repr_sales = data.groupby('Sales rep').sum()['Sale']

In [18]:
repr_sales

Sales rep
Charlotte     74599
Emma          65867
Ethan         40970
Liam          66989
Mia           88199
Noah          78575
Oliver        89355
Sophia       103480
William       80400
Name: Sale, dtype: int64

In [23]:
monthly_sale = data.groupby(pd.Grouper(freq='M')).sum()['Sale']
monthly_sale.index = monthly_sale.index.month_name()

In [24]:
monthly_sale

Date
January      69990
February     51847
March        67500
April        58401
May          40319
June         59397
July         64251
August       51571
September    55666
October      50093
November     57458
December     61941
Name: Sale, dtype: int64

In [25]:
workbook = pd.ExcelWriter("SalesReport.xlsx")
repr_sales.to_excel(workbook,sheet_name='Sales per rep')
monthly_sale.to_excel(workbook,sheet_name='Monthly')
workbook.close()

In [27]:
workbook = pd.ExcelWriter("SalesReport.xlsx")
repr_sales.to_excel(workbook,sheet_name='Sales per rep')
monthly_sale.to_excel(workbook,sheet_name='Monthly')

chart1 = workbook.book.add_chart({'type': 'column'})

chart1.add_series({
    'name':       '=Sales per rep',
    'categories': '=\'Sales per rep\'!$A$2:$A$10',
    'values':     '=\'Sales per rep\'!$B$2:$B$10',
})

workbook.sheets['Sales per rep'].insert_chart('D2', chart1)

chart1 = workbook.book.add_chart({'type': 'column'})

chart1.add_series({
    'name':       '=Monthly',
    'categories': '=Monthly!$A$2:$A$10',
    'values':     '=Monthly!$B$2:$B$10',
})

workbook.sheets['Monthly'].insert_chart('D2', chart1)

workbook.close()